app/controllers/departamentos_controller.rb

  def index
    @departamentos = Departamento.all
---
SELECT "departamentos".* FROM "departamentos"

  def show
    @id = params[:id]
    @produtos_por_departamento = Produto.where "departamento_id = ?", "#{@id}"
---
SELECT "produtos".* FROM "produtos" WHERE (departamento_id = '1')

  def create
    @departamento = Departamento.new(departamento_params)

    respond_to do |format|
      if @departamento.save
---
INSERT INTO "departamentos" ("nome", "created_at", "updated_at") VALUES (?, ?, ?)  [["nome", "Pagação"], ["created_at", "2021-01-02 20:38:02.195349"], ["updated_at", "2021-01-02 20:38:02.195349"]]

  def destroy
    @departamento.destroy
---
DELETE FROM "departamentos" WHERE "departamentos"."id" = ?  [["id", 4]]

    def set_departamento
      @departamento = Departamento.find(params[:id])
---
SELECT  "departamentos".* FROM "departamentos" WHERE "departamentos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]