app/controllers/produtos_controller.rb

SELECT  "produtos".* FROM "produtos" ORDER BY "produtos"."nome" DESC LIMIT ?  [["LIMIT", 2]]
SELECT  "produtos".* FROM "produtos" ORDER BY "produtos"."preco" ASC LIMIT ?  [["LIMIT", 1]]
---
    def index
        @produtos = Produto.order(nome: :asc).limit 5
        @produtos_com_desconto = Produto.order(:preco).limit 1

UPDATE "produtos" SET "preco" = ?, "updated_at" = ? WHERE "produtos"."id" = ?  [["preco", 899.5], ["updated_at", "2020-12-27 23:49:13.385298"], ["id", 17]]
---
    def update
        if @produto.update get_produto_params

INSERT INTO "produtos" ("nome", "descricao", "preco", "quantidade", "created_at", "updated_at", "departamento_id") VALUES (?, ?, ?, ?, ?, ?, ?)
---
    def create
        @produto = Produto.new get_produto_params
        if @produto.save

SELECT "produtos".* FROM "produtos" WHERE (nome like 'Celular')
---
    def search
        @nome = params[:nome]
        @produtos = Produto.where "nome like ?", "%#{@nome}%"